app/Controllers/Auth.php

    public function index()
    {
        $usermodel = new UserModel();
        $data['users'] =  $usermodel->findAll();
---
SELECT *
FROM `users`