app/Controllers/Driver.php

SELECT *
FROM `driver`
---
    public function index()
    {
        $drivermodel = new Drivermodel();
        $data['driver'] =  $drivermodel->findAll();