app/Controllers/RuanganControllers.php

    public function index()
    {
        $ruanganmodel = new RuanganModel();
        $data['room'] =  $ruanganmodel->findAll();
---
SELECT *
FROM `ruangan`